# pandas

In [2]:
import pandas as pd
import numpy as np

### Series

#### Basics

In [3]:
s = pd.Series([0,1,2,3])
s

0    0
1    1
2    2
3    3
dtype: int64

In [4]:
s = pd.Series([0,1,2], index=['a','b','c'])
s

a    0
b    1
c    2
dtype: int64

In [5]:
s.values, type(s.values)

(array([0, 1, 2], dtype=int64), numpy.ndarray)

In [6]:
s.index

Index(['a', 'b', 'c'], dtype='object')

#### Creation

In [7]:
s = pd.Series(['this', 'is', 'summer'])
s

0      this
1        is
2    summer
dtype: object

In [8]:
s = pd.Series({'one': 'this', 'two': 'is', 'three': 'summer'})
s

one        this
three    summer
two          is
dtype: object

In [9]:
a = np.random.randn(4)
a
s = pd.Series(a, index = ['winter','spring','summer','autumn'])
s

winter   -0.219583
spring    1.225282
summer   -0.853174
autumn   -0.057391
dtype: float64

#### numpy array operations

In [10]:
s1 =  s[s < 0]
s1

winter   -0.219583
summer   -0.853174
autumn   -0.057391
dtype: float64

In [14]:
s2 = s1 + 10
print(s2)
print(s1 + s2)

winter    9.780417
summer    9.146826
autumn    9.942609
dtype: float64
winter    9.560835
summer    8.293652
autumn    9.885217
dtype: float64

In [17]:
print(s+s1)

autumn   -0.114783
spring         NaN
summer   -1.706348
winter   -0.439165
dtype: float64

In [ ]:
s = pd.Series(np.random.randn(5))
s.where(s < 0, 1)

#### Function application

In [20]:
s = pd.Series([1,2,3,4])

for i in s:
    print(i)

print(s.map(np.square))

1
2
3
4
0     1
1     4
2     9
3    16
dtype: int64

#### Sorting

In [21]:
s = pd.Series('Happy families are all alike'.split(), index = ['z', 'y', 'x', 'w', 'v'])
s

z       Happy
y    families
x         are
w         all
v       alike
dtype: object

In [22]:
s2 = s.sort_values()
s2

z       Happy
v       alike
w         all
x         are
y    families
dtype: object

In [23]:
s3 = s.sort_index()
s3

v       alike
w         all
x         are
y    families
z       Happy
dtype: object

### DataFrame

#### Creation

In [24]:
data = {'feature_1': ['a', 'a', 'b', 'c', 'c', 'd'],
        'feature_2': np.random.randn(6),
        'feature_3': 1}
df = pd.DataFrame(data)
df

  feature_1  feature_2  feature_3
0         a   0.109414          1
1         a   1.223756          1
2         b  -0.566199          1
3         c   0.272011          1
4         c   0.248954          1
5         d  -0.005597          1

In [25]:
data = {'feature_1': ['a', 'a', 'b', 'c', 'c'],
        'feature_2': np.random.randn(5),
        'feature_3': 0,
        'feature_4': map(round, np.random.randn(5))}
df = pd.DataFrame(data, index=['Bob', 'Marie', 'Emmy', 'George', 'Leopold'])
df

        feature_1  feature_2  feature_3                           feature_4
Bob             a  -0.763773          0  <map object at 0x0000020854434F98>
Marie           a  -0.823344          0  <map object at 0x0000020854434F98>
Emmy            b  -1.383524          0  <map object at 0x0000020854434F98>
George          c  -0.998661          0  <map object at 0x0000020854434F98>
Leopold         c  -0.194735          0  <map object at 0x0000020854434F98>

In [26]:
heights_dict = {'Bob': 178, 'Marie': 167, 'Emmy': 180, 'George': 186, 'Leopold': 170} 
heights_df = pd.Series(heights_dict) 

weights_dict = {'Bob': 60, 'Marie': 58, 'Emmy': 10, 'George': 80, 'Leopold': 55} 
weights_df = pd.Series(weights_dict)

heights_vs_weights = pd.DataFrame({'height': heights_df, 'weight': weights_df})
heights_vs_weights

         height  weight
Bob         178      60
Emmy        180      10
George      186      80
Leopold     170      55
Marie       167      58

In [27]:
heights_dict = {'Bob': 178, 'Marie': 167, 'Emmy': 180} 
heights_df = pd.Series(heights_dict)
weights_dict = {'Jim': 78, 'Marie': 67, 'Emmy': 80} 
weights_df = pd.Series(weights_dict)

heights_vs_weights = pd.DataFrame({'height': heights_df, 'weight': weights_df})
heights_vs_weights

       height  weight
Bob     178.0     NaN
Emmy    180.0    80.0
Jim       NaN    78.0
Marie   167.0    67.0

In [ ]:
pd.DataFrame(np.random.rand(3, 2), columns=['foo', 'bar'], index=['a', 'b', 'c'])

In [ ]:
#from_csv = pd.read_csv('csv', header=None)
#from_csv = pd.read_csv('csv', names=['a','b','c'])

#### Summary information

In [28]:
heights_vs_weights.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Bob to Marie
Data columns (total 2 columns):
height    3 non-null float64
weight    3 non-null float64
dtypes: float64(2)
memory usage: 96.0+ bytes

In [29]:
heights_vs_weights.describe()

       height  weight
count     3.0     3.0
mean    175.0    75.0
std       7.0     7.0
min     167.0    67.0
25%     172.5    72.5
50%     178.0    78.0
75%     179.0    79.0
max     180.0    80.0

#### Indexing and selection

In [ ]:
df

In [ ]:
# access by label
y=df['feature_1']
y

In [ ]:
df[['feature_1','feature_2']]

In [ ]:
# Slicing
df[0:2]

In [ ]:
# does NOT work
# df[0]
# KeyError: 0
df[0:1]

In [ ]:
# iloc: preferred way for index-based access
df.iloc[1]

In [ ]:
df.iloc[:,:]

In [ ]:
df.iloc[np.array([True,False,True,False]),1:4]

In [ ]:
# loc: preferred way for label-based access

In [ ]:
df.loc['Emmy','feature_1':'feature_3']

In [ ]:
# ix: allows "mixed" access
df.ix['Emmy',0]

#### pandas -> numpy

In [ ]:
df = pd.DataFrame([222,333,444])
print df.values
type(df.values)

#### numpy -> pandas

In [ ]:
df = pd.DataFrame(np.arange(1,9).reshape(2,4))
df

### Function application

In [ ]:
# numpy ufuncs may be used directly
df.abs()

In [ ]:
df.sum()

In [ ]:
df.sum(axis=1)

In [ ]:
# use applymap() to apply custom functions to every element of a DataFrame
import math
def f(x): return math.factorial(abs(x))/x**2.
df.applymap(f)

In [ ]:
# use apply() to apply a function row-wise or column-wise:
def f(x): return x.sum()/len(x)
df.apply(f)

In [ ]:
df.apply(f, axis=1)

### Joins

In [30]:
frame1 = pd.DataFrame({'key1': range(3), 'val1': ['a', 'b', 'c']}, index=['blue','red','green'])
frame1

       key1 val1
blue      0    a
red       1    b
green     2    c

In [31]:
frame2 = pd.DataFrame({'key2': range(1, 5), 'val2': ['f', 'g', 'h', 'i']}, index=['water', 'fire', 'air', 'earth'])
frame2

       key2 val2
water     1    f
fire      2    g
air       3    h
earth     4    i

In [32]:
# merge joins on column names
# inner is also the default
pd.merge(frame1, frame2, left_on='key1', right_on='key2', how='inner')

   key1 val1  key2 val2
0     1    b     1    f
1     2    c     2    g

In [33]:
pd.merge(frame1, frame2, left_on='key1', right_on='key2', how='left')

   key1 val1  key2 val2
0     0    a   NaN  NaN
1     1    b   1.0    f
2     2    c   2.0    g

In [34]:
pd.merge(frame1, frame2, left_on='key1', right_on='key2', how='outer')

   key1 val1  key2 val2
0   0.0    a   NaN  NaN
1   1.0    b   1.0    f
2   2.0    c   2.0    g
3   NaN  NaN   3.0    h
4   NaN  NaN   4.0    i

In [ ]:
# join joins on index
frame1.index = ['water', 'air', 'no idea']
frame1

In [ ]:
frame2

In [ ]:
frame1.join(frame2)
# default is left join

In [ ]:
frame1.join(frame2, how='inner')

### Concatenation

In [ ]:
frame1.columns = ['key', 'val']
frame2.columns = ['key', 'val']
frame1

In [ ]:
# by default, duplicate indexes are kept
pd.concat([frame1,frame2])

In [ ]:
# by default, columns not existing in one dataframe are filled with NaN
frame2.columns = ['other_key', 'val']
pd.concat([frame1,frame2])

In [ ]:
# only common columns are kept
pd.concat([frame1,frame2], join='inner')

In [ ]:
# special keys for each dataframe
pd.concat([frame1,frame2], keys=['frame1','frame2'])

### Sorting

In [ ]:
data = {'feature_25': ['a', 'a', 'b', 'c', 'c'],
        'feature_333': np.random.randn(5),
        'feature_777': 0,
        'feature_4': map(round, np.random.randn(5))}
df = pd.DataFrame(data, index=['Bob', 'Marie', 'Emmy', 'George', 'Leopold'])
df

In [ ]:
# sort by row index
df.sort_index()

In [ ]:
# same as
df.sort_index(axis=0)

In [ ]:
# sort by column index
df.sort_index(axis=1)

In [ ]:
# sort by column value
df.sort_values(by='feature_333')

### Grouping and aggregation

In [35]:
df = pd.DataFrame({'cat1': ['blue','green','green','green'],
                   'cat2': ['square','circle','circle','square'],
                   'val1': np.random.randn(4),
                   'val2': np.ones(4)},
                 index=['first','second','third','fourth'])
df

         cat1    cat2      val1  val2
first    blue  square  0.882735   1.0
second  green  circle -0.096625   1.0
third   green  circle -1.904906   1.0
fourth  green  square -0.318128   1.0

In [36]:
g = df.groupby('cat1').mean()
g

           val1  val2
cat1
blue   0.882735   1.0
green -0.773220   1.0

In [37]:
g.loc['green']

val1   -0.77322
val2    1.00000
Name: green, dtype: float64

In [38]:
g=df.groupby(['cat1','cat2']).mean()
g

                  val1  val2
cat1  cat2
blue  square  0.882735   1.0
green circle -1.000766   1.0
      square -0.318128   1.0

In [39]:
g.loc['green','circle']

val1   -1.000766
val2    1.000000
Name: (green, circle), dtype: float64

In [40]:
def range(x): return max(x) - min(x)
df.groupby(['cat1', 'cat2']).agg(['mean','std', range])

                  val1                     val2
                  mean       std     range mean  std range
cat1  cat2
blue  square  0.882735       NaN  0.000000  1.0  NaN   0.0
green circle -1.000766  1.278648  1.808281  1.0  0.0   0.0
      square -0.318128       NaN  0.000000  1.0  NaN   0.0

### Pivoting

In [41]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['a', 'b'], name='category'),
                    columns=pd.Index(['one', 'two', 'three'], name='number'))
data

number    one  two  three
category
a           0    1      2
b           3    4      5

In [42]:
# stack() pivots one level of column labels to form a hierarchical row index
data.stack()

category  number
a         one       0
          two       1
          three     2
b         one       3
          two       4
          three     5
dtype: int32

In [43]:
# unstack() unpivots one level of hierarchical row index into a new level of column labels
# By default, the inner index level is pivoted
# equivalent to unstack(1)
data.stack().unstack()

number    one  two  three
category
a           0    1      2
b           3    4      5

In [44]:
# unpivots the outer level
data.stack().unstack(0)

category  a  b
number
one       0  3
two       1  4
three     2  5

In [ ]:
df = pd.DataFrame({'feature1': ['a','a','b','b','c','c','c','c','a','b','a'],
                     'feature2': ['one','two','three','three','one','two','two','one','three','three','three'],
                     'feature3': ['A','B','A','B','A','A','A','A','B','A','A'],
                     'score': [1,2,23,11,15,1,1,1,4,23,5]})
df

In [ ]:
df.pivot_table(index=['feature1','feature2'], columns=['feature3'])

In [ ]:
df.pivot_table(index=['feature2'], columns=['feature1','feature3'])

In [ ]:
# default aggregation function is mean()
df.pivot_table(index=['feature2'], columns=['feature1','feature3'], aggfunc='count')

### Statistics

In [ ]:
df = pd.DataFrame(np.arange(8).reshape(2,4))
df

In [ ]:
df.mean()

In [ ]:
df.mean(axis=0)

In [ ]:
df.mean(axis=1)

#### Inter-column correlations

In [45]:
df = pd.DataFrame(np.random.randn(16).reshape(4,4), columns=['a','b','c','d'], index=['one','two','three','four'])
df

              a         b         c         d
one   -0.093664  0.531320  0.183867  1.589553
two    1.826539 -1.280645  1.382448  0.810140
three -0.077247  0.537515 -1.636678 -0.587109
four  -0.076731  0.861566  0.453385 -1.414296

In [46]:
df.corr()

          a         b         c         d
a  1.000000 -0.986657  0.676416  0.342732
b -0.986657  1.000000 -0.601994 -0.453192
c  0.676416 -0.601994  1.000000  0.330262
d  0.342732 -0.453192  0.330262  1.000000

#### Histograms

In [47]:
df = df.applymap(round)
df

       a  b  c  d
one    0  1  0  2
two    2 -1  1  1
three  0  1 -2 -1
four   0  1  0 -1

In [48]:
# histogram on column
df.applymap(round)['a'].value_counts()

0    3
2    1
Name: a, dtype: int64

In [49]:
df.applymap(round).ix['two',:].value_counts()   # histogram on row 'two'

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

 1    2
 2    1
-1    1
Name: two, dtype: int64

### Data transformation

#### Missing values

In [50]:
s = pd.Series(['a', 'a', np.NaN, 'b'])
s.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [51]:
df = pd.DataFrame({'one': pd.Series(['a', 'a', np.NaN, 'b']), 'two':pd.Series(['a', np.NaN, 'c', np.NaN])})
df

   one  two
0    a    a
1    a  NaN
2  NaN    c
3    b  NaN

In [52]:
df.dropna()

  one two
0   a   a

In [53]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [55]:
df.dropna(axis=1,how='all')

   one  two
0    a    a
1    a  NaN
2  NaN    c
3    b  NaN

In [ ]:
df.fillna('xxx')

In [56]:
df.fillna({'one':'xxx', 'two':'yyy'})

   one  two
0    a    a
1    a  yyy
2  xxx    c
3    b  yyy

#### Duplicates

In [ ]:
df = pd.DataFrame({'one':[1,1,1,2,], 'two': [1,1,2,2]})
df

In [ ]:
df.duplicated()

In [ ]:
df.drop_duplicates()

#### Replacing values

In [ ]:
df

In [ ]:
df.replace(1,999)

In [ ]:
df.replace({'one':{1:999}, 'two':{1:0}})

#### Discretization

In [ ]:
ages = pd.Series([66,18,31,50,22,70])
#left boundary is exclusive, right is inclusive
age_categories = pd.cut(ages,[18,30,40,50,60,70,80],include_lowest=True)
age_categories

In [ ]:
# split into quantiles
age_categories = pd.qcut(ages, q=4, precision=1)
age_categories

#### Indicator variables

In [ ]:
df = pd.DataFrame({'col1': list('abaa'), 'col2': ['air','water','fire','earth']})
df

In [ ]:
pd.get_dummies(df)